# LiningArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..LiningArea Property
FabricationPart Class See Also
---
The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double LiningArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LiningArea As Double
	Get
```

Visual C++
---
```text
public:
property double LiningArea {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace